flex_and_rails/rails_awesome_stuff/app/controllers/contexts_controller.rb

SELECT * FROM "contexts" WHERE (parent_id is null) LIMIT 1
---
  def find_all
    respond_to do |format|
      format.amf  { render :amf => Context.find(:all) }