flex_and_rails/rails_awesome_stuff/app/controllers/tasks_controller.rb

SELECT * FROM "contexts" WHERE ("contexts"."id" = 2)
---
  def find_context
    @context = Context.find params[:context_id]